app/Http/Resources/IncidentSpaResource.php

select `categories`.*, `category_type`.`type_id` as `pivot_type_id`, `category_type`.`category_id` as `pivot_category_id` from `categories` inner join `category_type` on `categories`.`id` = `category_type`.`category_id` where `category_type`.`type_id` = 4
---
    public function toArray($request)
    {
        return [
            'id' => $this->id,
            'reference' => $this->reference,
            'name' => $this->name,
            'description' => $this->description,
            'location_description' => $this->location_description,
            'coordinates' => [
                'latitude' => $this->latitude,
                'longitude' => $this->longitude,
            ],
            'latitude' => $this->latitude,
            'longitude' => $this->longitude,
            'suburb_id' => $this->suburb_id,
            'is_public' => $this->is_public,
            'created' => $this->created_at,
            'category' => new CategoryResource($this->type->categories->first()),