app/Http/Controllers/SPA/IncidentController.php

    public function index()
    {
        $incidents = EloquentBuilder::to(Incident::class, request()->except(['page', 'per_page', 'start_date', 'end_date', 'has_range']));
        if(request('has_range')){
            $incidents = $incidents->whereBetween('created_at', [request()->start_date, request()->end_date]);
        }else{
            $incidents = $incidents->where('created_at', '<', Carbon::now());
        }

        return IncidentResource::collection($incidents->paginate(10));
---
select * from `incidents` where `created_at` < '2021-04-24 17:45:55' and `incidents`.`deleted_at` is null order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `incidents` where `created_at` < '2021-04-24 17:45:55' and `incidents`.`deleted_at` is null