app/Http/Controllers/SPA/StatusController.php

select * from `statuses` where `statuses`.`deleted_at` is null
---
    public function index()
    {
        $statuses = Status::all();