app/Incident.php

    public function user()
    {
        return $this->users()->first();
---
select `users`.*, `incident_user`.`incident_id` as `pivot_incident_id`, `incident_user`.`user_id` as `pivot_user_id` from `users` inner join `incident_user` on `users`.`id` = `incident_user`.`user_id` where `incident_user`.`incident_id` = 63 and `users`.`deleted_at` is null limit 1