app/Http/Controllers/ChartController.php

select DATE_FORMAT(created_at, '%d %b %Y') AS date, COUNT(*) AS total from `incidents` where `created_at` between '2021-04-19 00:00' and '2021-04-25 23:59' and `incidents`.`deleted_at` is null group by `date` order by `date` asc
---
    public function incidents()
    {
        $data = [];
        $today = Carbon::now();
        $from = $today->startOfMonth()->format('Y-m-d H:i');
        $to = $today->endOfMonth()->format('Y-m-d H:i');

        $incidents = Incident::select([
            DB::raw('DATE_FORMAT(created_at, \'%d %b %Y\') AS date'),
//            DB::raw('created_at AS date'),//DATE_FORMAT(created_at, \'%d %b %Y\')
            DB::raw('COUNT(*) AS total'),
            ])
            ->whereBetween('created_at', [$from, $to])
            ->groupBy('date')
            ->orderBy('date', 'ASC')->get();

select * from `statuses` where `statuses`.`deleted_at` is null
select * from `incidents` where `created_at` between '2021-04-19 00:00' and '2021-04-25 23:59' and `incidents`.`deleted_at` is null order by `created_at` asc
---
    public function statuses()
    {
        $data = [];
        $today = Carbon::now();
        $statuses = Status::all();
        $incidents = Incident::whereBetween('created_at', [$today->startOfWeek()->format('Y-m-d H:i'), $today->endOfWeek()->format('Y-m-d H:i')])->Orderby('created_at')->get();

select `id`, `name`, `state_color_id` from `types`
select * from `incidents` where `created_at` between '2021-04-19 00:00' and '2021-04-25 23:59' and `incidents`.`deleted_at` is null
---
    public function types()
    {
        $data = [];
        $today = Carbon::now();
        $types = Type::all('id', 'name', 'state_color_id');
        $incidents = Incident::whereBetween('created_at', [$today->startOfWeek()->format('Y-m-d H:i'), $today->endOfWeek()->format('Y-m-d H:i')])->get();