app/Http/Controllers/DepartmentController.php

select * from `statuses` where `statuses`.`deleted_at` is null
select * from `departments` where `departments`.`deleted_at` is null
---
    public function create()
    {
        return view('backend.departments.create')->with('statuses', Department::$statuses);