app/Http/Controllers/DistrictController.php

select * from `districts` where `districts`.`deleted_at` is null
---
    public function index()
    {
        $districts = District::all();