app/Http/Controllers/HomeController.php

select `id`, `name` from `categories`
---
    public function index()
    {
        $incidents = Incident::with('users')->get()->sortByDesc('created_at');
        $statues = Status::all('id', 'name');
        $categories = Category::all('id', 'name');