app/Http/Controllers/IncidentController.php

select * from `incidents` where `incidents`.`deleted_at` is null order by `created_at` desc limit 12 offset 0
select * from `statuses` where `statuses`.`id` in (7, 8, 9, 10, 11, 12) and `statuses`.`deleted_at` is null
select `users`.*, `incident_user`.`incident_id` as `pivot_incident_id`, `incident_user`.`user_id` as `pivot_user_id` from `users` inner join `incident_user` on `users`.`id` = `incident_user`.`user_id` where `incident_user`.`incident_id` in (1, 17, 22, 32, 34, 37, 56, 58, 62, 69, 90, 100) and `users`.`deleted_at` is null
select count(*) as aggregate from `incidents` where `incidents`.`deleted_at` is null
select `id`, `name` from `categories`
---
    public function index()
    {

        $incidents = Incident::with('users', 'status')->orderByDesc('created_at')->paginate(12);
        $statuses = Status::whereIn('group', ['incidents', 'both'])->select('id', 'name');
        $categories = Category::all('id', 'name');

select `id`, `name` from `categories`
---
    public function edit(Incident $incident)
    {
        $this->authorize('update', $incident);
        $categories = Category::all('id', 'name');