app/Http/Controllers/PermissionController.php

select * from `permissions`
---
    public function index()
    {
        $permissions = Permission::all(); //Get all permissions