app/Http/Controllers/RoleController.php

    public function index() {
        $roles = Role::all();//Get all roles

        return view('backend.roles.index')->with('roles', $roles);
---
select * from `roles`