app/Http/Controllers/StatusController.php

    public function index()
    {
        $statuses = Cache::remember('all_statuses', now()->addHour(), function () {
            return Status::all('id', 'name', 'description', 'model_type', 'is_active');
        });

        $colors = Cache::remember('all_colors', now()->addHour(), function () use ($statuses){
            return StateColor::select('id', 'name', 'css_color', 'css_class')->whereIn('id', $statuses->pluck('id'))->get();
        });
---
select `id`, `name`, `description`, `model_type`, `is_active` from `statuses` where `statuses`.`deleted_at` is null
select `id`, `name`, `css_color`, `css_class` from `state_colors` where `id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12)