app/Http/Controllers/StateColorController.php

select * from `state_colors`
---
    public function index()
    {
        $state_colors = StateColor::all();