app/Http/Controllers/TypeController.php

    public function index()
    {
        $types = Type::all();
---
select * from `types`