app/Http/Controllers/UserController.php

    public function index()
    {
        $users = User::withTrashed()->with(['status:id,name,state_color_id', 'status.state_color', 'departments:name', 'roles:name'])->get();
        $statuses = Status::where('model_type', 'App\User')->get();
        $roles = Role::all();
---
select * from `state_colors` where `state_colors`.`id` in (2, 6, 8)
select * from `users`
select `id`, `name`, `state_color_id` from `statuses` where `statuses`.`id` in (1, 2, 3, 4) and `statuses`.`deleted_at` is null
select * from `statuses` where `model_type` = 'App\User' and `statuses`.`deleted_at` is null
select * from `roles`

    public function edit($user)
    {
        //if the logged in user is the same as the user being updated then, they must use the update profile page.
        if($user->id === Auth::id()){
            return response()->redirectToRoute('profile.edit', $user->uuid);
        }

        $roles = Role::pluck('name', 'id'); //Get all roles
        $departments = Department::pluck('name', 'id');
        $statuses = Status::whereIn('model_type', ['App\User'])->pluck('name', 'id');
---
select `name`, `id` from `statuses` where `model_type` in ('App\User') and `statuses`.`deleted_at` is null

    public function update(Request $request, $user)
    {
        //Validate name, email and password fields
        $request->validate(
            [
                'firstname'=>'required|max:120',
                'lastname'=>'required|max:120',
                'contactnumber'=>'required|max:20',
                'roles' => 'required'
            ]
        );

        $input = $request->only(['firstname', 'lastname', 'contactnumber', 'status_id']); //Retreive the name, email and password fields

        $roles = $request['roles']; //Retreive all roles
        $user->fill($input)->save();
---
update `users` set `contactnumber` = '(150) 298-8773', `status_id` = '1', `users`.`updated_at` = '2021-04-24 18:28:18' where `id` = 4