app/Http/Controllers/WorkingGroupController.php

    public function index()
    {
        $working_groups = WorkingGroup::all();
---
select * from `working_groups`

    public function create()
    {
        $incident = null;
        if (request()->payload) {
            $incident = Incident::whereUuid(request()->payload)->first();
        }
        $leaders = User::role(['engineer', 'specialist'])->get();
        $statuses = Status::where('model_type', 'App\WorkingGroup')->get();
---
select * from `statuses` where `model_type` = 'App\WorkingGroup' and `statuses`.`deleted_at` is null