app/Providers/RouteServiceProvider.php

    public function boot()
    {
        //

        parent::boot();
        Route::bind('user', function ($value) {
            $user = \App\User::withTrashed()->whereUuid($value)->firstOrFail();
---
select * from `users` where `uuid` in ('[BINARY DATA]') limit 1